WilliamTakeshi/nrf54l15-flpr-pac/nrf54l15-flpr.svd
        <register>
          <name>INTENSET</name>
          <description>Enable interrupt</description>
          <addressOffset>0x304</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>RXPTRUPD</name>
              <description>Write '1' to enable interrupt for event RXPTRUPD</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOPPED</name>
              <description>Write '1' to enable interrupt for event STOPPED</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXPTRUPD</name>
              <description>Write '1' to enable interrupt for event TXPTRUPD</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRAMESTART</name>
              <description>Write '1' to enable interrupt for event FRAMESTART</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENCLR</name>
          <description>Disable interrupt</description>
          <addressOffset>0x308</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>RXPTRUPD</name>
              <description>Write '1' to disable interrupt for event RXPTRUPD</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOPPED</name>
              <description>Write '1' to disable interrupt for event STOPPED</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXPTRUPD</name>
              <description>Write '1' to disable interrupt for event TXPTRUPD</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRAMESTART</name>
              <description>Write '1' to disable interrupt for event FRAMESTART</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ENABLE</name>
          <description>Enable I2S module</description>
          <addressOffset>0x500</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable I2S module</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>CONFIG</name>
          <description>Unspecified</description>
          <headerStructName>I2S_CONFIG</headerStructName>
          <access>read-write</access>
          <addressOffset>0x504</addressOffset>
          <register>
            <name>MODE</name>
            <description>I2S mode</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MODE</name>
                <description>I2S mode</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Master</name>
                    <description>Master mode. SCK and LRCK generated from internal master clcok (MCK) and output on pins defined by PSEL.xxx.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Slave</name>
                    <description>Slave mode. SCK and LRCK generated by external master and received on pins defined by PSEL.xxx</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RXEN</name>
            <description>Reception (RX) enable</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RXEN</name>
                <description>Reception (RX) enable</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Reception disabled and now data will be written to the RXD.PTR address.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Reception enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TXEN</name>
            <description>Transmission (TX) enable</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000001</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TXEN</name>
                <description>Transmission (TX) enable</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Transmission disabled and now data will be read from the RXD.TXD address.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Transmission enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>MCKEN</name>
            <description>Master clock generator enable</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000001</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MCKEN</name>
                <description>Master clock generator enable</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Master clock generator disabled and PSEL.MCK not connected(available as GPIO).</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Master clock generator running and MCK output on PSEL.MCK.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>MCKFREQ</name>
            <description>I2S clock generator control</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <resetValue>0x20000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MCKFREQ</name>
                <description>I2S MCK frequency configuration NOTE: Enumerations are deprecated, use MCKFREQ equation. NOTE: The 12 least significant bits of the register are ignored and shall be set to zero.</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>32MDIV2</name>
                    <description>32 MHz / 2 = 16.0 MHz Deprecated, use MCKFREQ equation.</description>
                    <value>0x80000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32MDIV3</name>
                    <description>32 MHz / 3 = 10.6666667 MHz Deprecated, use MCKFREQ equation.</description>
                    <value>0x50000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32MDIV4</name>
                    <description>32 MHz / 4 = 8.0 MHz Deprecated, use MCKFREQ equation.</description>
                    <value>0x40000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32MDIV5</name>
                    <description>32 MHz / 5 = 6.4 MHz Deprecated, use MCKFREQ equation.</description>
                    <value>0x30000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32MDIV6</name>
                    <description>32 MHz / 6 = 5.3333333 MHz Deprecated, use MCKFREQ equation.</description>
                    <value>0x28000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32MDIV8</name>
                    <description>32 MHz / 8 = 4.0 MHz Deprecated, use MCKFREQ equation.</description>
                    <value>0x20000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32MDIV10</name>
                    <description>32 MHz / 10 = 3.2 MHz Deprecated, use MCKFREQ equation.</description>
                    <value>0x18000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32MDIV11</name>
                    <description>32 MHz / 11 = 2.9090909 MHz Deprecated, use MCKFREQ equation.</description>
                    <value>0x16000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32MDIV15</name>
                    <description>32 MHz / 15 = 2.1333333 MHz Deprecated, use MCKFREQ equation.</description>
                    <value>0x11000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32MDIV16</name>
                    <description>32 MHz / 16 = 2.0 MHz Deprecated, use MCKFREQ equation.</description>
                    <value>0x10000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32MDIV21</name>
                    <description>32 MHz / 21 = 1.5238095 MHz Deprecated, use MCKFREQ equation.</description>
                    <value>0x0C000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32MDIV23</name>
                    <description>32 MHz / 23 = 1.3913043 MHz Deprecated, use MCKFREQ equation.</description>
                    <value>0x0B000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32MDIV30</name>
                    <description>32 MHz / 30 = 1.0666667 MHz Deprecated, use MCKFREQ equation.</description>
                    <value>0x08800000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32MDIV31</name>
                    <description>32 MHz / 31 = 1.0322581 MHz Deprecated, use MCKFREQ equation.</description>
                    <value>0x08400000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32MDIV32</name>
                    <description>32 MHz / 32 = 1.0 MHz Deprecated, use MCKFREQ equation.</description>
                    <value>0x08000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32MDIV42</name>
                    <description>32 MHz / 42 = 0.7619048 MHz Deprecated, use MCKFREQ equation.</description>
                    <value>0x06000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32MDIV63</name>
                    <description>32 MHz / 63 = 0.5079365 MHz Deprecated, use MCKFREQ equation.</description>
                    <value>0x04100000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32MDIV125</name>
                    <description>32 MHz / 125 = 0.256 MHz Deprecated, use MCKFREQ equation.</description>
                    <value>0x020C0000</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RATIO</name>
            <description>MCK / LRCK ratio</description>
            <addressOffset>0x014</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000006</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RATIO</name>
                <description>MCK / LRCK ratio</description>
                <lsb>0</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>32X</name>
                    <description>LRCK = MCK / 32</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>48X</name>
                    <description>LRCK = MCK / 48</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>64X</name>
                    <description>LRCK = MCK / 64</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>96X</name>
                    <description>LRCK = MCK / 96</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>128X</name>
                    <description>LRCK = MCK / 128</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>192X</name>
                    <description>LRCK = MCK / 192</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>256X</name>
                    <description>LRCK = MCK / 256</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>384X</name>
                    <description>LRCK = MCK / 384</description>
                    <value>0x7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>512X</name>
                    <description>LRCK = MCK / 512</description>
                    <value>0x8</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
